Enums/ВидыМероприятийТрудовойДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыМероприятийТрудовойДеятельности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переименование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановлениеВторойПрофессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретЗаниматьДолжность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возобновление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоДоговораГПХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеДоговораГПХ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыМероприятийТрудовойДеятельности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция Код(Значение) Экспорт
	
	Если Значение = Прием Тогда
		Возврат 1;
	ИначеЕсли Значение = Перевод Тогда
		Возврат 2;
	ИначеЕсли Значение = Переименование Тогда
		Возврат 3;
	ИначеЕсли Значение = УстановлениеВторойПрофессии Тогда
		Возврат 4;
	ИначеЕсли Значение = Увольнение Тогда
		Возврат 5;
	ИначеЕсли Значение = ЗапретЗаниматьДолжность Тогда
		Возврат 6;
	ИначеЕсли Значение = Приостановление Тогда
		Возврат 7;
	ИначеЕсли Значение = Возобновление Тогда
		Возврат 8;
	ИначеЕсли Значение = НачалоДоговораГПХ Тогда
		Возврат 9;
	ИначеЕсли Значение = ОкончаниеДоговораГПХ Тогда
		Возврат 10;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
